<?php

return [
    'bot_token' => env('TELEGRAM_BOT_TOKEN', ''),

    // Stock transfer group mapping (match by Business Location name)
    // Values can be:
    // - a single chat_id string (ex: '-1001234567890')
    // - an array of chat_id strings
    // - a comma-separated string of chat_ids
    'stock_transfer' => [
        'from_location_channels' => [
            'គ្នាយើង-សាខាកម្ពុជាក្រោម' => '-1002817135261',
            'គ្នាយើង-វីអាយភី' => '-1002564488156',
            'គ្នាយើង-សាខាកាប់គោ' => '-1002630289029',
            'គ្នាយើង-សាខាអ៊ីអន' => '-1002726952260',
            'គ្នាយើង-ស្តុកធំ' => '-1002695137946',
            'គ្នាយើង-ស្តុកជាង (កំពុងជួសជុល)' => '-1002671863573',
            'គ្នាយើង-​​ស្តុកជាង​ (ស្តុកធំ)' => '-1002777229314',
            'នាយើង-KY STORE (Display' => '-1002755123993',
            'គ្នាយើង-វីអាយភី (Display)' => '-1002647963492',
        ],
        'to_location_channels' => [
            'គ្នាយើង-សាខាកម្ពុជាក្រោម' => '-1002607741081',
            'គ្នាយើង-វីអាយភី' => '-1002874733717',
            'គ្នាយើង-សាខាកាប់គោ' => '-1002795079483',
            'គ្នាយើង-សាខាអ៊ីអន' => '-1002848976105',
            'គ្នាយើង-ស្តុកធំ' => '-1002856080623',
            'គ្នាយើង-ស្តុកជាង (កំពុងជួសជុល)' => '-1002746225943',
            'គ្នាយើង-​​ស្តុកជាង​ (ស្តុកធំ)' => '-1002606883125',
            'គ្នាយើង-KY STORE (Display)' => '-1002893175039',
            'គ្នាយើង-វីអាយភី (Display)' => '-1002880212656',
        ],
    ],
];
